Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отпуска</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания отпуска</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПодсчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПодсчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьДляПеревода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипДокументаДляЗаявленийСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипДокументаДляЗаявленийСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаУвольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаПеревод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриемНаРаботу/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьДанныеОрганизации();
	Если  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ТрудовойДоговор")  Тогда
		
		Элементы.ТрудовойДоговор.Видимость = Истина;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаУвольнение") Тогда
		Элементы.ЗаявлениеНаУвольнение.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаОтпуск") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаПеревод") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Истина;
	Иначе   
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
	КонецЕсли;
	Объект.ДатаЗ =Объект.Дата;
	Объект.ДатаЗ = Лев(Объект.ДатаЗ,10);
КонецПроцедуры
&НаСервере
Процедура ПолучитьДанныеОрганизации()
	
	Объект.НаименованиеОрганизации = Константы.НаименованиеОрганизации.Получить();
	Объект.ЮридическийАдресОрганизации = Константы.ЮридическийАдресОрганизации.Получить();
	Объект.ИНН = Константы.ИННОрганизации.Получить();
		Объект.Директор = Константы.Директор.Получить();
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Объект.Должность = ДолжностьСотрудника(Объект.Сотрудник);
	Объект.Оклад = ОкладСотрудника(Объект.Сотрудник); 
	Объект.ДатаПриема = ДатаПриемаСотрудника(Объект.Сотрудник);
	Объект.Серия = СерияПаспортаСотрудника(Объект.Сотрудник);
	Объект.НомерПаспорт = НомерПаспортаСотрудника(Объект.Сотрудник); 
	Объект.КемВыдан = КемВыданПаспортСотрудника(Объект.Сотрудник);
	Объект.ДатаВыдачи = ДатаВыдачиПаспортаСотрудника(Объект.Сотрудник);
	Объект.АдресРегистрации = АдресПоПрописке(Объект.Сотрудник);
	Объект.КодПодразделения = КодПодразделения(Объект.Сотрудник);
КонецПроцедуры

Функция ДолжностьСотрудника(Сотрудники)
	
	Возврат Сотрудники.Должность;
	
КонецФункции

Функция ОкладСотрудника(Сотрудники)
	
	Возврат Сотрудники.Оклад;
	
КонецФункции 



Функция ДатаПриемаСотрудника(Сотрудники)
	
	Возврат Сотрудники.ДатаПриёма;
	
КонецФункции    

Функция СерияПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.Серия;
	
КонецФункции      
Функция НомерПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.Номер;
	
КонецФункции   

Функция КемВыданПаспортСотрудника(Сотрудники)
	
	Возврат Сотрудники.КемВыдан;
	
КонецФункции   

Функция ДатаВыдачиПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.ДатаВыдачи;
	
КонецФункции
Функция АдресПоПрописке(Сотрудники)
	
	Возврат Сотрудники.АдресПоПрописке;
	
КонецФункции
Функция КодПодразделения(Сотрудники)
	
	Возврат Сотрудники.КодПодразделения;
	
КонецФункции 

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	Если  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ТрудовойДоговор")  Тогда
		
		Элементы.ТрудовойДоговор.Видимость = Истина;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаУвольнение") Тогда
		Элементы.ЗаявлениеНаУвольнение.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаОтпуск") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаПеревод") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Истина;
	Иначе   
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Объект.ДатаНачалаПодсчет= Объект.ДатаНачала;
	Объект.ДатаОкончанияПодсчет = Объект.ДатаОкончания;
	Объект.КоличествоДней = (НачалоДня(Объект.ДатаОкончания) - НачалоДня(Объект.ДатаНачала))/(60*60*24);
	
КонецПроцедуры
